In [23]:
import pandas as pd
import numpy as np
df=pd.DataFrame.from_dict({'Name': ['Hasee', 'Kittu', 'Neeru', 'Saru', 'Munny', np.NaN], 'Age': [18, 19, 20, 23, 50, np.NaN], 'City': ['Krishna', 'Thuni', 'Vizag', np.NaN, 'Srikakulam', np.NaN]})
df

    Name   Age        City
0  Hasee  18.0     Krishna
1  Kittu  19.0       Thuni
2  Neeru  20.0       Vizag
3   Saru  23.0         NaN
4  Munny  50.0  Srikakulam
5    NaN   NaN         NaN

In [30]:
df.isnull()

    Name    Age   City
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False   True
4  False  False  False
5   True   True   True

In [31]:
df.isnull().sum()

Name    1
Age     1
City    2
dtype: int64

In [32]:
df.dropna(axis=0)

    Name   Age        City
0  Hasee  18.0     Krishna
1  Kittu  19.0       Thuni
2  Neeru  20.0       Vizag
4  Munny  50.0  Srikakulam

In [33]:
df.dropna(how='all')

    Name   Age        City
0  Hasee  18.0     Krishna
1  Kittu  19.0       Thuni
2  Neeru  20.0       Vizag
3   Saru  23.0         NaN
4  Munny  50.0  Srikakulam

In [39]:
df.dropna(subset='City')

    Name   Age        City
0  Hasee  18.0     Krishna
1  Kittu  19.0       Thuni
2  Neeru  20.0       Vizag
4  Munny  50.0  Srikakulam

In [46]:
df.dropna(thresh=4)

Empty DataFrame
Columns: [Name, Age, City]
Index: []

In [47]:
df['Age'].replace(np.NaN, 18)

0    18.0
1    19.0
2    20.0
3    23.0
4    50.0
5    18.0
Name: Age, dtype: float64

In [37]:
pd.cut(np.array([1, 10]), 3)

[(0.991, 4.0], (7.0, 10.0]]
Categories (3, interval[float64, right]): [(0.991, 4.0] < (4.0, 7.0] < (7.0, 10.0]]

In [53]:
a=df.fillna(0)
a

    Name   Age        City
0  Hasee  18.0     Krishna
1  Kittu  19.0       Thuni
2  Neeru  20.0       Vizag
3   Saru  23.0           0
4  Munny  50.0  Srikakulam
5      0   0.0           0

In [54]:
df['Name'].str.split(',')

0    [Hasee]
1    [Kittu]
2    [Neeru]
3     [Saru]
4    [Munny]
5        NaN
Name: Name, dtype: object

In [55]:
df.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
dtype: bool

In [58]:
a.duplicated().sum()

0

In [57]:
a.drop_duplicates()

    Name   Age        City
0  Hasee  18.0     Krishna
1  Kittu  19.0       Thuni
2  Neeru  20.0       Vizag
3   Saru  23.0           0
4  Munny  50.0  Srikakulam
5      0   0.0           0